#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьФорму(Форма) Экспорт 
	
	ИмяФормы = Форма.ИмяФормы; 

	Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" тогда
		
		ДополнитьФормуРеализации(Форма);
		
	КонецЕсли;
	
КонецПроцедуры
		
Процедура ДополнитьФормуРеализации(Форма)
	
	//Добавление команды Заполнить
	НоваяКоманда = Форма.Команды.Добавить("Заполнить");
	НоваяКоманда.Заголовок = "Заполнить";
	НоваяКоманда.Действие = "ВКМ_КомандаЗаполнить";	
	
	НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_КнопкаЗаполнить", Тип("КнопкаФормы"), Форма.КоманднаяПанель);
	НовыйЭлемент.Заголовок = "Заполнить";
	НовыйЭлемент.ИмяКоманды = "Заполнить";
	
	//изменение Параметров выбора реквизита Договор
	ПараметрыВыбора = Новый Массив;
	СписокВидовДоговоров = Новый СписокЗначений;
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Покупатель);
	
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", СписокВидовДоговоров));
	
	Форма.Элементы.Договор.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

#КонецОбласти