#language: ru

@tree

Функционал: Закрытие документа "Обслуживание клиента"

Как Специалист я хочу
выполнить заполнение документа "Обслуживание клиента" 
чтобы проверить корректность заполнения документа  

Контекст:
	Дано я подключаю TestClient "Этот клиент" логин "Васечкин Олег (специалист)" пароль ""

Сценарий: Заполнение документа "Обслуживание клиента" после выполненных специалистом работ
И В командном интерфейсе я выбираю 'Добавленные объекты (ВКМ)' 'Обслуживание клиентов'
Тогда открылось окно 'Обслуживание клиентов'
*Первый документ
И в таблице "Список" я перехожу к первой строке
И в таблице "Список" я выбираю текущую строку
Тогда открылось окно 'Обслуживание клиента * от *'
И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыФактическиПотраченоЧасов"
*Первая строка
И в таблице "ВыполненныеРаботы" я перехожу к первой строке
И в таблице "ВыполненныеРаботы" я выбираю текущую строку
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст '7'
И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыЧасыКОплатеКлиенту"
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст '7'
И в таблице "ВыполненныеРаботы" я завершаю редактирование строки
*Вторая строка
И в таблице "ВыполненныеРаботы" я перехожу к следующей строке
И в таблице "ВыполненныеРаботы" я выбираю текущую строку
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст '5'
И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыЧасыКОплатеКлиенту"
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст '5'
И в таблице "ВыполненныеРаботы" я завершаю редактирование строки
*Третья строка
И в таблице "ВыполненныеРаботы" я перехожу к следующей строке
И в таблице "ВыполненныеРаботы" я выбираю текущую строку
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст '2'
И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыЧасыКОплатеКлиенту"
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст '2'
И в таблице "ВыполненныеРаботы" я завершаю редактирование строки
Тогда открылось окно 'Обслуживание клиента * от *'
И В текущем окне я нажимаю кнопку командного интерфейса 'Присоединенные файлы'
И я нажимаю на кнопку с именем 'ДобавитьИзФайлаНаДиске'
	Тогда открылось окно 'Обслуживание клиента * от * *'
	И В текущем окне я нажимаю кнопку командного интерфейса 'Основное'
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна 'Обслуживание клиента * от * *' в течение 20 секунд
*Второй документ
И в таблице "Список" я перехожу к следующей строке
И в таблице "Список" я выбираю текущую строку
Тогда открылось окно 'Обслуживание клиента * от *'
И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыФактическиПотраченоЧасов"
*Первая строка
И в таблице "ВыполненныеРаботы" я перехожу к первой строке
И в таблице "ВыполненныеРаботы" я выбираю текущую строку
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст '1'
И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыЧасыКОплатеКлиенту"
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст '1'
И в таблице "ВыполненныеРаботы" я завершаю редактирование строки
*Вторая строка
И в таблице "ВыполненныеРаботы" я перехожу к следующей строке
И в таблице "ВыполненныеРаботы" я выбираю текущую строку
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст '1'
И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыЧасыКОплатеКлиенту"
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст '1'
И в таблице "ВыполненныеРаботы" я завершаю редактирование строки
*Третья строка
И в таблице "ВыполненныеРаботы" я перехожу к следующей строке
И в таблице "ВыполненныеРаботы" я выбираю текущую строку
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст '1'
И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыЧасыКОплатеКлиенту"
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст '1'
И в таблице "ВыполненныеРаботы" я завершаю редактирование строки
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна 'Обслуживание клиента * от * *' в течение 20 секунд
*Третий документ
И в таблице "Список" я перехожу к следующей строке
И в таблице "Список" я выбираю текущую строку
Тогда открылось окно 'Обслуживание клиента * от *'
И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыФактическиПотраченоЧасов"
*Первая строка
И в таблице "ВыполненныеРаботы" я перехожу к первой строке
И в таблице "ВыполненныеРаботы" я выбираю текущую строку
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст '2'
И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыЧасыКОплатеКлиенту"
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст '2'
И в таблице "ВыполненныеРаботы" я завершаю редактирование строки
*Вторая строка
И в таблице "ВыполненныеРаботы" я перехожу к следующей строке
И в таблице "ВыполненныеРаботы" я выбираю текущую строку
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст '1'
И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыЧасыКОплатеКлиенту"
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст '1'
И в таблице "ВыполненныеРаботы" я завершаю редактирование строки
*Третья строка
И в таблице "ВыполненныеРаботы" я перехожу к следующей строке
И в таблице "ВыполненныеРаботы" я выбираю текущую строку
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст '1'
И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыЧасыКОплатеКлиенту"
И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст '1'
И в таблице "ВыполненныеРаботы" я завершаю редактирование строки
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна 'Обслуживание клиента * от * *' в течение 20 секунд
