#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий



Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ПлановыеОтпуска.Записывать = Истина;
	Движения.ВКМ_ПлановыеОтпуска.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник,
	|	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала,
	|		ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ)) +1 КАК КоличествоДней
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
	|ГДЕ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() цикл
			
		Движение = Движения.ВКМ_ПлановыеОтпуска.Добавить();
		Движение.Период = НачалоГода(Год);
		Движение.Сотрудник = Результат.Сотрудник;
		Движение.КоличествоДней = Результат.КоличествоДней;
			
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли