#Область ОбработчикиКомандФормы 
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Дата = Дата(1,1,1) тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена дата", Объект, "Дата");
		Возврат;
		
	КонецЕсли;
		
	ЗаполнитьНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Выплаты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникомОстатки.Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникомОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудником.Остатки(&Дата,) КАК ВКМ_ВзаиморасчетыССотрудникомОстатки";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(Объект.Дата, ВидГраницы.Исключая));
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() цикл
		
		НоваяСтрока = Объект.Выплаты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
