#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	Движения.ВКМ_ВзаиморасчетыССотрудником.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудником.Записать();
	
	Для каждого СтрВыплата из Выплаты цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудником.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Движение, СтрВыплата);
		Движение.Период = Дата;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли